m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/osa/src/fsl_os_abstraction_bm.c
    osa_status_t retVal = kStatus_OSA_Idle;

    *setFlags = pEvent->flags & flagsToWait;

    /* Check the event flag first, if does not meet wait condition, deal with timeout. */
    if ((((!waitAll) && (*setFlags))) || (*setFlags == flagsToWait))
    {
        INT_SYS_DisableIRQGlobal();
        pEvent->isWaiting = false;
        if(kEventAutoClear == pEvent->clearMode)
        {
            pEvent->flags &= ~flagsToWait;
        }
        INT_SYS_EnableIRQGlobal();
        return kStatus_OSA_Success;
    }
    else
    {
        if (0 == timeout)
        {
            /* If timeout is 0 and wait condition is not met, return kStatus_OSA_Timeout. */
            return kStatus_OSA_Timeout;
        }
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
        else if (pEvent->isWaiting)
        {
            /* Check for timeout */
            currentTime = OSA_TimeGetMsec();
            if (pEvent->timeout < OSA_TimeDiff(pEvent->time_start, currentTime))
            {
                INT_SYS_DisableIRQGlobal();
                pEvent->isWaiting = false;
                INT_SYS_EnableIRQGlobal();
                retVal = kStatus_OSA_Timeout;
            }
        }
        else if(timeout != OSA_WAIT_FOREVER)    /* If no timeout, don't start the timer */
        {
            /* Start the timeout counter */
            INT_SYS_DisableIRQGlobal();
            pEvent->isWaiting = true;
            INT_SYS_EnableIRQGlobal();
            pEvent->time_start = OSA_TimeGetMsec();
            pEvent->timeout = timeout;
        }
#endif
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventGetFlags
 * Description   : Get event flags status.
 * Return current event flags.
 *
 *END**************************************************************************/
event_flags_t OSA_EventGetFlags(event_t *pEvent)
{
    assert(pEvent);

    return pEvent->flags;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventSet
 * Description   : Set one or more event flags of an event object.
 * Return kStatus_OSA_Success if set successfully, kStatus_OSA_Error if failed.
 *
 *END**************************************************************************/
osa_status_t OSA_EventSet(event_t *pEvent, event_flags_t flagsToSet)
{
    assert(pEvent);
    /* Set flags ensuring atomic operation */
    INT_SYS_DisableIRQGlobal();
    pEvent->flags |= flagsToSet;
    INT_SYS_EnableIRQGlobal();

    return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventClear
 * Description   : Clear one or more event flags of an event object.
 * Return kStatus_OSA_Success if clear successfully, kStatus_OSA_Error if failed.
 *
 *END**************************************************************************/
osa_status_t OSA_EventClear(event_t *pEvent, event_flags_t flagsToClear)
{
    assert(pEvent);
    /* Clear flags ensuring atomic operation */
    INT_SYS_DisableIRQGlobal();
    pEvent->flags &= ~flagsToClear;
    INT_SYS_EnableIRQGlobal();

    return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventDestroy
 * Description   : This function is used to destroy a event object. Return
 * kStatus_OSA_Success if the event object is destroyed successfully, otherwise
 * return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_EventDestroy(event_t *pEvent)
{
    assert(pEvent);

    return kStatus_OSA_Success;
}

/* The task APIs are only available if TASK_MAX_NUM>0. */
#if (TASK_MAX_NUM > 0)

/* Global variales for task. */
static task_handler_t g_curTask; /* Current task. */

/*
 * All task control blocks in g_taskControlBlockPool will be linked as a
 * list, and the list is managed by the pointer g_freeTaskControlBlock.
 */
static task_control_block_t g_taskControlBlockPool[TASK_MAX_NUM];

/*
 * Pointer to the free task control blocks. To create a task, we should get
 * task control block from this pointer. When task is destroyed, the control
 * block will be returned and managed by this pointer.
 */
static task_control_block_t *g_freeTaskControlBlock;

/* Head node of task list, all tasks will be linked to this head node. */
static task_control_block_t g_taskListHead;

/*FUNCTION**********************************************************************
 *
 * Function Name : task_init
 * Description   : This function is used to initialize bare metal's task system,
 * it will prepare task control block pool and initialize corresponding
 * structures. This function should be called before creating any tasks.
 *
 *END**************************************************************************/
void task_init(void)
{
    int32_t i = TASK_MAX_NUM-1;

    g_taskControlBlockPool[i].next = NULL;

    while (i--)
    {
        /* Link all task control blocks to a list. */
        g_taskControlBlockPool[i].next = &g_taskControlBlockPool[i+1];
    }

    g_freeTaskControlBlock = g_taskControlBlockPool;

    /* Initialize task list. */
    g_taskListHead.next = &g_taskListHead;
    g_taskListHead.prev = &g_taskListHead;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskCreate
 * Description   : This function will register the task function and parameter
 * to task list, so that the task functions can be called in turn. Return
 * kStatus_OSA_Success if register successfully, otherwise return kStatus_OSA_Error;
 *
 *END**************************************************************************/
osa_status_t OSA_TaskCreate(task_t          task,
                         uint8_t        *name,
                         uint16_t        stackSize,
                         task_stack_t   *stackMem,
                         uint16_t        priority,
                         task_param_t    param,
                         bool            usesFloat,
                         task_handler_t *handler)
{
    task_control_block_t *p_newTaskControlBlock;
    task_control_block_t *p_taskListTail;

    if (!g_freeTaskControlBlock)
    {
        /* No more task control blocks can be got. */
        return kStatus_OSA_Error;
    }
    else
    {
        /* Get new task control block from pool. */
        p_newTaskControlBlock         = g_freeTaskControlBlock;
        g_freeTaskControlBlock        = g_freeTaskControlBlock->next;
        /* Set task entry and parameter.*/
        p_newTaskControlBlock->p_func = task;
        p_newTaskControlBlock->param  = param;
        /* Add p_newTaskControlBlock to the tail of task list. */
        p_taskListTail                = g_taskListHead.prev;
        p_taskListTail->next          = p_newTaskControlBlock;
        p_newTaskControlBlock->next   = &g_taskListHead;
        g_taskListHead.prev           = p_newTaskControlBlock;
        p_newTaskControlBlock->prev   = p_taskListTail;
        /* Task handler is pointer of task control block. */
        *handler = p_newTaskControlBlock;

        return kStatus_OSA_Success;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskDestroy
 * Description   : This function will remove task control block from task list,
 * so that the task functions will not called by anymore.
 * Return kStatus_OSA_Success if successfully, otherwise return kStatus_OSA_Error;
 *
 *END**************************************************************************/
osa_status_t OSA_TaskDestroy(task_handler_t handler)
{
    assert(handler);
    /* Remove task control block from task list. */
    handler->prev->next = handler->next;
    handler->next->prev = handler->prev;

