m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/osa/src/fsl_os_abstraction_bm.c
    /*
     * If current task is destroyed, then g_curTask will point to the previous
     * task, so that the subsequent tasks could be called. Check the function
     * OSA_Start for more details.
     */
    if (handler == g_curTask)
    {
        g_curTask = handler->prev;
    }

    /* Put task control block back to pool. */
    handler->prev = NULL;
    handler->next = g_freeTaskControlBlock;
    g_freeTaskControlBlock = handler;

    return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskYield
 * Description   : This function is not implement with bare metal.
 *
 *END**************************************************************************/
osa_status_t OSA_TaskYield(void)
{
    return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskGetHandler
 * Description   : This function is used to get current active task's handler.
 *
 *END**************************************************************************/
task_handler_t OSA_TaskGetHandler(void)
{
    return g_curTask;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskGetPriority
 * Description   : This function is not implement with bare metal.
 *
 *END**************************************************************************/
uint16_t OSA_TaskGetPriority(task_handler_t handler)
{
    return 0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskSetPriority
 * Description   : This function is not implement with bare metal.
 *
 *END**************************************************************************/
osa_status_t OSA_TaskSetPriority(task_handler_t handler, uint16_t priority)
{
    return kStatus_OSA_Success;
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQCreate
 * Description   : This function is used to create a message queue.
 * Return the handle to the message queue if create successfully, otherwise
 * return 0.
 *
 *END**************************************************************************/
msg_queue_handler_t OSA_MsgQCreate(msg_queue_t *queue,
                                        uint16_t  message_number,
                                        uint16_t  message_size)
{
    assert(queue);

    queue->number  = message_number;
    queue->size    = message_size;
    queue->head    = 0;
    queue->tail    = 0;
    queue->isEmpty = true;

    if(kStatus_OSA_Success == OSA_SemaCreate(&queue->queueSem, 0))
    {
        return queue;
    }
    else
    {
        return NULL;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQPut
 * Description   : This function is used to put a message to a message queue.
 * Return kStatus_OSA_Success if the message is put successfully, otherwise
 * return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_MsgQPut(msg_queue_handler_t handler, void* pMessage)
{
    assert(handler);
    uint32_t *from_ptr, *to_ptr;
    uint16_t msgSize;

    /* Check that there is room in the queue */
    INT_SYS_DisableIRQGlobal();
    if((handler->tail != handler->head) || (handler->isEmpty))
    {
        from_ptr = (uint32_t*)pMessage;
        to_ptr   = &handler->queueMem[handler->tail * handler->size];

        /* Copy entire message into the queue, based on the size configured at creation */
        msgSize = handler->size;
        while(msgSize--)
        {
            *to_ptr++ = *from_ptr++;
        }

        /* Adjust tail pointer and wrap in case the end of the buffer is reached */
        ++handler->tail;
        if(handler->tail == handler->number)
        {
            handler->tail = 0;
        }

        /* If queue was empty, clear the empty flag and signal that it is not empty anymore */
        if(handler->isEmpty)
        {
            handler->isEmpty = false;
            OSA_SemaPost(&handler->queueSem);
        }
        INT_SYS_EnableIRQGlobal();

        return kStatus_OSA_Success;
    }
    else
    {
        INT_SYS_EnableIRQGlobal();
        return kStatus_OSA_Error;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQGet
 * Description   : This function checks the queue's status, if it is not empty,
 * get message from it and return kStatus_OSA_Success, otherwise, timeout will
 * be used for wait. The parameter timeout indicates how long should wait in
 * milliseconds. Pass OSA_WAIT_FOREVER to wait indefinitely, pass 0 will return
 * kStatus_OSA_Timeout immediately if queue is empty.
 * This function returns kStatus_OSA_Success if message is got successfully,
 * returns kStatus_OSA_Timeout if message queue is empty within the specified
 * 'timeout', returns kStatus_OSA_Error if any errors occur during waiting,
 * returns kStatus_OSA_Idle if message queue is empty and 'timeout' is
 * not exhausted, because wait functions should not block with bare metal.
 *
 *END**************************************************************************/
osa_status_t OSA_MsgQGet(msg_queue_handler_t handler,
                           void               *pMessage,
                           uint32_t            timeout)
{
    assert(handler);
    osa_status_t retVal = kStatus_OSA_Error;
    uint32_t *from_ptr, *to_ptr;
    uint16_t msgSize;

    INT_SYS_DisableIRQGlobal();
    /* Check if the queue is not empty */
    if(!handler->isEmpty)
    {
        from_ptr = &handler->queueMem[handler->head * handler->size];
        to_ptr   = (uint32_t*)(pMessage);

        /* Copy entire message into the queue, based on the size configured at creation */
        msgSize = handler->size;
        while(msgSize--)
        {
            *to_ptr++ = *from_ptr++;
        }

        /* Adjust head pointer and wrap in case the end of the buffer is reached */
        ++handler->head;
        if(handler->head == handler->number)
        {
            handler->head = 0;
        }

