m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/osa/src/fsl_os_abstraction_bm.c
        /* If queue is empty, clear the semaphore. */
        if(handler->head == handler->tail)
        {
            handler->isEmpty = true;
            /* Set semapohre to 0 because the queue is empty. */
            (void)OSA_SemaWait(&handler->queueSem, 0);
        }
        INT_SYS_EnableIRQGlobal();

        retVal = kStatus_OSA_Success;
    }
    else
    {
        INT_SYS_EnableIRQGlobal();
        /* Wait for the semaphore if the queue was empty */
        retVal = OSA_SemaWait(&handler->queueSem, timeout);
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQDestroy
 * Description   : This function is used to destroy the message queue.
 * Return kStatus_OSA_Success if the message queue is destroyed successfully,
 * otherwise return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_MsgQDestroy(msg_queue_handler_t handler)
{
    assert(handler);
    return OSA_SemaDestroy(&handler->queueSem);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MemAlloc
 * Description   : This function is used to allocate amount of memory in bytes.
 * Return the pointer to the memory if success, otherwise return NULL;
 *
 *END**************************************************************************/
void * OSA_MemAlloc(size_t size)
{
    return malloc(size);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MemAllocZero
 * Description   : This function is used to allocate amount of memory in bytes
 * and initializes it to 0.
 * Return the pointer to the memory if success, otherwise return NULL;
 *
 *END**************************************************************************/
void * OSA_MemAllocZero(size_t size)
{
    return calloc(1, size);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MemFree
 * Description   : This function is used to free the memory previously allocated.
 *
 *END**************************************************************************/
osa_status_t OSA_MemFree(void *ptr)
{
    free(ptr);
    return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeDelay
 * Description   : This function is used to delay for a number of milliseconds.
 *
 *END**************************************************************************/
void OSA_TimeDelay(uint32_t delay)
{
    uint32_t currTime, timeStart;

    timeStart = OSA_TimeGetMsec();

    do {
        currTime = OSA_TimeGetMsec(); /* Get current time stamp */
    } while (delay >= OSA_TimeDiff(timeStart, currTime));
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeGetMsec
 * Description   : This function gets current time in milliseconds.
 *
 *END**************************************************************************/
__WEAK_FUNC uint32_t OSA_TimeGetMsec(void)
{
#if (FSL_OSA_BM_TIMER_CONFIG == FSL_OSA_BM_TIMER_NONE)
    return 0U;
#elif (FSL_OSA_BM_TIMER_CONFIG == FSL_OSA_BM_TIMER_LPTMER)
    return LPTMR_HAL_GetCounterValue(BM_LPTMR_BASE);
#else
    return 0U;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : interrupt_handler_register
 * Description   : This function is used to install interrupt handler.
 *
 *END**************************************************************************/
osa_int_handler_t OSA_InstallIntHandler(int32_t IRQNumber,
                                        osa_int_handler_t handler)
{
#if defined ( __IAR_SYSTEMS_ICC__ )
_Pragma ("diag_suppress = Pm138")
#endif
    return (osa_int_handler_t)INT_SYS_InstallHandler((IRQn_Type)IRQNumber, handler);
#if defined ( __IAR_SYSTEMS_ICC__ )
_Pragma ("diag_remark = PM138")
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EnterCritical
 * Description   : This function is used to ensure some code will not be preempted.
 *
 *END**************************************************************************/
void OSA_EnterCritical(osa_critical_section_mode_t mode)
{
    if (kCriticalDisableInt == mode)
    {
        INT_SYS_DisableIRQGlobal();
    }
    else
    {
        return;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_ExitCritical
 * Description   : This function is used to exit critical section.
 *
 *END**************************************************************************/
void OSA_ExitCritical(osa_critical_section_mode_t mode)
{
    if (kCriticalDisableInt == mode)
    {
        INT_SYS_EnableIRQGlobal();
    }
    else
    {
        return;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_Init
 * Description   : This function is used to setup the basic services, it should
 * be called first in function main. Return kStatus_OSA_Success if services
 * are initialized successfully, otherwise return kStatus_OSA_Error.
 *
 *END**************************************************************************/
osa_status_t OSA_Init(void)
{
#if (TASK_MAX_NUM > 0)
    task_init();
#endif

#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    OSA_TimeInit();
#endif

    return kStatus_OSA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_Start
 * Description   : This function is used to start RTOS scheduler.
 *
 *END**************************************************************************/
osa_status_t OSA_Start(void)
{
#if (TASK_MAX_NUM > 0)
    g_curTask = &g_taskListHead;

    for(;;)
    {
        if (g_curTask->p_func)
        {
            g_curTask->p_func(g_curTask->param);
        }
        g_curTask = g_curTask->next;
    }
#else
    for(;;)
    {
    }
#endif
}

#if (TASK_MAX_NUM > 0)
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_PollAllOtherTasks
 * Description   : This function calls all task functions except current task
 * one time. It is only for bare metal.
 *
 *END**************************************************************************/
void OSA_PollAllOtherTasks(void)
{
    task_handler_t curTaskSave = g_curTask;
    g_curTask = g_taskListHead.next;

    while ((g_curTask->p_func) && (g_curTask!=curTaskSave))
    {
        g_curTask->p_func(g_curTask->param);
        g_curTask = g_curTask->next;
    }
    g_curTask = curTaskSave;
}
#endif

/*******************************************************************************
 * EOF
 ******************************************************************************/
